tutorials/rheoEFoam/selecMembrane/NernstPlanck/solution1D/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Website:  https://openfoam.org                  |
|   \\  /    A nd           | Version:  9                                     |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    cyc0
    {
	type            cyclic;
    }
   
    reservoir
    {
	type            fixedValue;
	value           uniform (0 0 0);       
    }
    
    membrane
    {
	type            fixedValue;
	value           uniform (0 0 0);      
    }

    cyc1
    {
	type            cyclic;    
    }

    frontAndBack
    {
	type            empty;     
    }
}

// ************************************************************************* //
