tutorials/rheoEFoam/selecMembrane/NernstPlanck/solution1D/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Website:  https://openfoam.org                  |
|   \\  /    A nd           | Version:  9                                     |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    cyc0
    {
	type            cyclic;
    }
   
    reservoir
    {
	type            zeroGradient; 
    }
    
    membrane
    {
	type            zeroGradient;  
    }

    cyc1
    {
	type            cyclic;    
    }

    frontAndBack
    {
	type            empty;     
    }
}

// ************************************************************************* //
